// Взаимодействия с боссом + финал игры

// Битва с боссом доступна только при наличии черных щита и посоха. Нет в инвентаре одного И второго, то при входе к боссу - смерть. Проверка на этов функции ниже

export function checkBossRequirements() {
  /*
    Проверить наличие посоха и щита
    ЕСЛИ нет - запускается лог дракона с особым текстом и босс убивает персонажа (или выкидывает его из боя?)
    ЕСЛИ есть - запускается бой. Можно использовать processEnemyTurn()



    */
}

/* 
В ЮИ.
- клик на локацию с боссом - предупреждение по типу "ты подходишь к местности, где свет практически исчезает. Воздух кажется спертым и мертвым, голова кружится от нехватки кислорода. Впереди тебя ждет что-то зловещее. Возможно, тебе не суждено вернуться и стоит тщательнее обдумать свое решение и подготовиться.
Точно хочешь идти дальше?"

*/
